; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-85)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b13)
    (on b13 b18)
    (on b18 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b3)
    (on b3 b24)
    (on-table b24)
    (clear b23)
    (on b23 b4)
    (on b4 b21)
    (on b21 b7)
    (on b7 b1)
    (on b1 b25)
    (on b25 b9)
    (on b9 b8)
    (on-table b8)
    (clear b12)
    (on b12 b6)
    (on b6 b14)
    (on b14 b15)
    (on b15 b10)
    (on b10 b20)
    (on-table b20)
    (clear b19)
    (on b19 b22)
    (on b22 b16)
    (on-table b16))
 (:goal (and 
(on b21 b12)
))
)

; plan
1. (unstack b23 b4)
   deleted: (on b23 b4) (clear b23) (arm-empty)
   added: (holding b23) (clear b4)
   goals met: 0 of 1
2. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
3. (unstack b4 b21)
   deleted: (on b4 b21) (clear b4) (arm-empty)
   added: (holding b4) (clear b21)
   goals met: 0 of 1
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
5. (unstack b21 b7)
   deleted: (on b21 b7) (clear b21) (arm-empty)
   added: (holding b21) (clear b7)
   goals met: 0 of 1
6. (stack b21 b12)
   deleted: (clear b12) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b12)
   goals met: 1 of 1
